ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/AM263X/ADC_ADC_CFG_502C0000h.xml
	<bitfield id="CHSEL" width="5" begin="19" end="15" resetval="0x0" description="SOC15 Channel Select. Selects the channel to be converted when SOC15 is received by the ADC. Single-ended Signaling Mode [SIGNALMODE = 0]:  00h ADCIN0  01h ADCIN1  02h ADCIN2  03h ADCIN3   ...   1Dh  ADCIN29   1Eh  ADCIN30   1Fh  ADCIN31 Differential Signaling Mode [SIGNALMODE = 1]:  00h ADCIN0 [non-inverting] and ADCIN1 [inverting]  01h ADCIN0 [non-inverting] and ADCIN1 [inverting]  02h ADCIN2 [non-inverting] and ADCIN3 [inverting]  03h ADCIN2 [non-inverting] and ADCIN3 [inverting]  04h ADCIN4 [non-inverting] and ADCIN5 [inverting]  05h ADCIN4 [non-inverting] and ADCIN5 [inverting]   ...   0Eh  ADCIN26 [non-inverting] and ADCIN27 [inverting]   0Fh  ADCIN26 [non-inverting] and ADCIN27 [inverting]  10h ADCIN28 [non-inverting] and ADCIN29 [inverting]  11h ADCIN28 [non-inverting] and ADCIN29 [inverting]   1Eh  ADCIN30 [non-inverting] and ADCIN31 [inverting]   1Fh  ADCIN30 [non-inverting] and ADCIN31 [inverting]" range="19:15" rwaccess="R/W"/>
	<bitfield id="RESOLUTION" width="3" begin="14" end="12" resetval="0x0" description="Placeholder for per-SOC resolution" range="14:12" rwaccess="R"/>
	<bitfield id="SIGNALMODE" width="2" begin="11" end="10" resetval="0x0" description="Placeholder for per-SOC signal mode" range="11:10" rwaccess="R"/>
	<bitfield id="ACQPS" width="9" begin="8" end="0" resetval="0x0" description="SOC15 Acquisition Prescale. Controls the sample and hold window for this SOC.     000h Reserved  001h Reserved  002h Sample window is 3 system clock cycles wide  003h Sample window is 4 system clock cycles wide   ...   1FFh Sample window is 512 system clock cycles wide The configured acquisition time must be at least as long as one ADCCLK cycle for correct ADC operation.  The configured acquisition time must also be at least 3 SYSCLK cycles long. The device datasheet will also specify a minimum sample and hold window duration." range="8:0" rwaccess="R/W"/>
	</register><register id="ADC_CFG_ADCEVTSTAT" acronym="ADC_CFG_ADCEVTSTAT" offset="96" width="16" description="ADC Event Status Register.">
		<bitfield id="PPB4ZERO" width="1" begin="14" end="14" resetval="0x0" description="Post Processing Block 4 Zero Crossing Flag. When set indicates the ADCPPB4RESULT register has changed sign. This bit is gated by EOC signal. Note: these bits are set even when the corresponding enable in ADCEVTINTSEL is not set.  Because of this, an ISR may need to examine both the ADCEVTSTAT and ADCEVTINTSEL registers to determine the source of the interrupt.  Note: If software sets the clear bit on the same cycle that hardware is trying to set the flag bit, then hardware has priority" range="14" rwaccess="R"/>
	<bitfield id="PPB4TRIPLO" width="1" begin="13" end="13" resetval="0x0" description="Post Processing Block 4 Trip Low Flag. When set indicates a digital compare trip low event has occurred. Note: these bits are set even when the corresponding enable in ADCEVTINTSEL is not set.  Because of this, an ISR may need to examine both the ADCEVTSTAT and ADCEVTINTSEL registers to determine the source of the interrupt.  Note: If software sets the clear bit on the same cycle that hardware is trying to set the flag bit, then hardware has priority" range="13" rwaccess="R"/>
	<bitfield id="PPB4TRIPHI" width="1" begin="12" end="12" resetval="0x0" description="Post Processing Block 4 Trip High Flag. When set indicates a digital compare trip high event has occurred. Note: these bits are set even when the corresponding enable in ADCEVTINTSEL is not set.  Because of this, an ISR may need to examine both the ADCEVTSTAT and ADCEVTINTSEL registers to determine the source of the interrupt.  Note: If software sets the clear bit on the same cycle that hardware is trying to set the flag bit, then hardware has priority" range="12" rwaccess="R"/>
	<bitfield id="PPB3ZERO" width="1" begin="10" end="10" resetval="0x0" description="Post Processing Block 3 Zero Crossing Flag. When set indicates the ADCPPB3RESULT register has changed sign. This bit is gated by EOC signal. Note: these bits are set even when the corresponding enable in ADCEVTINTSEL is not set.  Because of this, an ISR may need to examine both the ADCEVTSTAT and ADCEVTINTSEL registers to determine the source of the interrupt.  Note: If software sets the clear bit on the same cycle that hardware is trying to set the flag bit, then hardware has priority" range="10" rwaccess="R"/>
	<bitfield id="PPB3TRIPLO" width="1" begin="9" end="9" resetval="0x0" description="Post Processing Block 3 Trip Low Flag. When set indicates a digital compare trip low event has occurred. Note: these bits are set even when the corresponding enable in ADCEVTINTSEL is not set.  Because of this, an ISR may need to examine both the ADCEVTSTAT and ADCEVTINTSEL registers to determine the source of the interrupt.  Note: If software sets the clear bit on the same cycle that hardware is trying to set the flag bit, then hardware has priority" range="9" rwaccess="R"/>
	<bitfield id="PPB3TRIPHI" width="1" begin="8" end="8" resetval="0x0" description="Post Processing Block 3 Trip High Flag. When set indicates a digital compare trip high event has occurred. Note: these bits are set even when the corresponding enable in ADCEVTINTSEL is not set.  Because of this, an ISR may need to examine both the ADCEVTSTAT and ADCEVTINTSEL registers to determine the source of the interrupt.  Note: If software sets the clear bit on the same cycle that hardware is trying to set the flag bit, then hardware has priority" range="8" rwaccess="R"/>
	<bitfield id="PPB2ZERO" width="1" begin="6" end="6" resetval="0x0" description="Post Processing Block 2 Zero Crossing Flag. When set indicates the ADCPPB2RESULT register has changed sign. This bit is gated by EOC signal. Note: these bits are set even when the corresponding enable in ADCEVTINTSEL is not set.  Because of this, an ISR may need to examine both the ADCEVTSTAT and ADCEVTINTSEL registers to determine the source of the interrupt.  Note: If software sets the clear bit on the same cycle that hardware is trying to set the flag bit, then hardware has priority" range="6" rwaccess="R"/>
	<bitfield id="PPB2TRIPLO" width="1" begin="5" end="5" resetval="0x0" description="Post Processing Block 2 Trip Low Flag. When set indicates a digital compare trip low event has occurred. Note: these bits are set even when the corresponding enable in ADCEVTINTSEL is not set.  Because of this, an ISR may need to examine both the ADCEVTSTAT and ADCEVTINTSEL registers to determine the source of the interrupt.  Note: If software sets the clear bit on the same cycle that hardware is trying to set the flag bit, then hardware has priority" range="5" rwaccess="R"/>
	<bitfield id="PPB2TRIPHI" width="1" begin="4" end="4" resetval="0x0" description="Post Processing Block 2 Trip High Flag. When set indicates a digital compare trip high event has occurred. Note: these bits are set even when the corresponding enable in ADCEVTINTSEL is not set.  Because of this, an ISR may need to examine both the ADCEVTSTAT and ADCEVTINTSEL registers to determine the source of the interrupt.  Note: If software sets the clear bit on the same cycle that hardware is trying to set the flag bit, then hardware has priority" range="4" rwaccess="R"/>
	<bitfield id="PPB1ZERO" width="1" begin="2" end="2" resetval="0x0" description="Post Processing Block 1 Zero Crossing Flag. When set indicates the ADCPPB1RESULT register has changed sign. This bit is gated by EOC signal. Note: these bits are set even when the corresponding enable in ADCEVTINTSEL is not set.  Because of this, an ISR may need to examine both the ADCEVTSTAT and ADCEVTINTSEL registers to determine the source of the interrupt.  Note: If software sets the clear bit on the same cycle that hardware is trying to set the flag bit, then hardware has priority" range="2" rwaccess="R"/>
	<bitfield id="PPB1TRIPLO" width="1" begin="1" end="1" resetval="0x0" description="Post Processing Block 1 Trip Low Flag. When set indicates a digital compare trip low event has occurred. Note: these bits are set even when the corresponding enable in ADCEVTINTSEL is not set.  Because of this, an ISR may need to examine both the ADCEVTSTAT and ADCEVTINTSEL registers to determine the source of the interrupt.  Note: If software sets the clear bit on the same cycle that hardware is trying to set the flag bit, then hardware has priority" range="1" rwaccess="R"/>
	<bitfield id="PPB1TRIPHI" width="1" begin="0" end="0" resetval="0x0" description="Post Processing Block 1 Trip High Flag. When set indicates a digital compare trip high event has occurred. Note: these bits are set even when the corresponding enable in ADCEVTINTSEL is not set.  Because of this, an ISR may need to examine both the ADCEVTSTAT and ADCEVTINTSEL registers to determine the source of the interrupt.  Note: If software sets the clear bit on the same cycle that hardware is trying to set the flag bit, then hardware has priority" range="0" rwaccess="R"/>
	</register><register id="ADC_CFG_ADCEVTCLR" acronym="ADC_CFG_ADCEVTCLR" offset="100" width="16" description="ADC Event Clear Register.">
		<bitfield id="PPB4ZERO" width="1" begin="14" end="14" resetval="0x0" description="Post Processing Block 4 Zero Crossing Clear. Clears the corresponding zero crossing flag in the ADCEVTSTAT register. Note: If software sets the clear bit on the same cycle that hardware is trying to set the flag bit, then hardware has priority" range="14" rwaccess="R/W1TS"/>
	<bitfield id="PPB4TRIPLO" width="1" begin="13" end="13" resetval="0x0" description="Post Processing Block 4 Trip Low Clear. Clears the corresponding trip low flag in the ADCEVTSTAT register. Note: If software sets the clear bit on the same cycle that hardware is trying to set the flag bit, then hardware has priority" range="13" rwaccess="R/W1TS"/>
	<bitfield id="PPB4TRIPHI" width="1" begin="12" end="12" resetval="0x0" description="Post Processing Block 4 Trip High Clear. Clears the corresponding trip high flag in the ADCEVTSTAT register. Note: If software sets the clear bit on the same cycle that hardware is trying to set the flag bit, then hardware has priority" range="12" rwaccess="R/W1TS"/>
	<bitfield id="PPB3ZERO" width="1" begin="10" end="10" resetval="0x0" description="Post Processing Block 3 Zero Crossing Clear. Clears the corresponding zero crossing flag in the ADCEVTSTAT register. Note: If software sets the clear bit on the same cycle that hardware is trying to set the flag bit, then hardware has priority" range="10" rwaccess="R/W1TS"/>
	<bitfield id="PPB3TRIPLO" width="1" begin="9" end="9" resetval="0x0" description="Post Processing Block 3 Trip Low Clear. Clears the corresponding trip low flag in the ADCEVTSTAT register. Note: If software sets the clear bit on the same cycle that hardware is trying to set the flag bit, then hardware has priority" range="9" rwaccess="R/W1TS"/>
	<bitfield id="PPB3TRIPHI" width="1" begin="8" end="8" resetval="0x0" description="Post Processing Block 3 Trip High Clear. Clears the corresponding trip high flag in the ADCEVTSTAT register. Note: If software sets the clear bit on the same cycle that hardware is trying to set the flag bit, then hardware has priority" range="8" rwaccess="R/W1TS"/>
	<bitfield id="PPB2ZERO" width="1" begin="6" end="6" resetval="0x0" description="Post Processing Block 2 Zero Crossing Clear. Clears the corresponding zero crossing flag in the ADCEVTSTAT register. Note: If software sets the clear bit on the same cycle that hardware is trying to set the flag bit, then hardware has priority" range="6" rwaccess="R/W1TS"/>
	<bitfield id="PPB2TRIPLO" width="1" begin="5" end="5" resetval="0x0" description="Post Processing Block 2 Trip Low Clear. Clears the corresponding trip low flag in the ADCEVTSTAT register. Note: If software sets the clear bit on the same cycle that hardware is trying to set the flag bit, then hardware has priority" range="5" rwaccess="R/W1TS"/>
	<bitfield id="PPB2TRIPHI" width="1" begin="4" end="4" resetval="0x0" description="Post Processing Block 2 Trip High Clear. Clears the corresponding trip high flag in the ADCEVTSTAT register. Note: If software sets the clear bit on the same cycle that hardware is trying to set the flag bit, then hardware has priority" range="4" rwaccess="R/W1TS"/>
	<bitfield id="PPB1ZERO" width="1" begin="2" end="2" resetval="0x0" description="Post Processing Block 1 Zero Crossing Clear. Clears the corresponding zero crossing flag in the ADCEVTSTAT register. Note: If software sets the clear bit on the same cycle that hardware is trying to set the flag bit, then hardware has priority" range="2" rwaccess="R/W1TS"/>
	<bitfield id="PPB1TRIPLO" width="1" begin="1" end="1" resetval="0x0" description="Post Processing Block 1 Trip Low Clear. Clears the corresponding trip low flag in the ADCEVTSTAT register. Note: If software sets the clear bit on the same cycle that hardware is trying to set the flag bit, then hardware has priority" range="1" rwaccess="R/W1TS"/>
	<bitfield id="PPB1TRIPHI" width="1" begin="0" end="0" resetval="0x0" description="Post Processing Block 1 Trip High Clear. Clears the corresponding trip high flag in the ADCEVTSTAT register. Note: If software sets the clear bit on the same cycle that hardware is trying to set the flag bit, then hardware has priority" range="0" rwaccess="R/W1TS"/>
	</register><register id="ADC_CFG_ADCEVTSEL" acronym="ADC_CFG_ADCEVTSEL" offset="104" width="16" description="ADC Event Selection Register.">
		<bitfield id="PPB4ZERO" width="1" begin="14" end="14" resetval="0x0" description="Post Processing Block 4 Zero Crossing Event Enable. Setting this bit allows the corresponding rising zero crossing flag to activate the event signal to the PWM blocks. The flag must be cleared before it can produce additional events to the PWM blocks." range="14" rwaccess="R/W"/>
	<bitfield id="PPB4TRIPLO" width="1" begin="13" end="13" resetval="0x0" description="Post Processing Block 4 Trip Low Event Enable. Setting this bit allows the corresponding rising trip low flag to activate the event signal to the PWM blocks. The flag must be cleared before it can produce additional events to the PWM blocks." range="13" rwaccess="R/W"/>
	<bitfield id="PPB4TRIPHI" width="1" begin="12" end="12" resetval="0x0" description="Post Processing Block 4 Trip High Event Enable. Setting this bit allows the corresponding rising trip high flag to activate the event signal to the PWM blocks. The flag must be cleared before it can produce additional events to the PWM blocks." range="12" rwaccess="R/W"/>
	<bitfield id="PPB3ZERO" width="1" begin="10" end="10" resetval="0x0" description="Post Processing Block 3 Zero Crossing Event Enable. Setting this bit allows the corresponding rising zero crossing flag to activate the event signal to the PWM blocks. The flag must be cleared before it can produce additional events to the PWM blocks." range="10" rwaccess="R/W"/>
	<bitfield id="PPB3TRIPLO" width="1" begin="9" end="9" resetval="0x0" description="Post Processing Block 3 Trip Low Event Enable. Setting this bit allows the corresponding rising trip low flag to activate the event signal to the PWM blocks. The flag must be cleared before it can produce additional events to the PWM blocks." range="9" rwaccess="R/W"/>
	<bitfield id="PPB3TRIPHI" width="1" begin="8" end="8" resetval="0x0" description="Post Processing Block 3 Trip High Event Enable. Setting this bit allows the corresponding rising trip high flag to activate the event signal to the PWM blocks. The flag must be cleared before it can produce additional events to the PWM blocks." range="8" rwaccess="R/W"/>
	<bitfield id="PPB2ZERO" width="1" begin="6" end="6" resetval="0x0" description="Post Processing Block 2 Zero Crossing Event Enable. Setting this bit allows the corresponding rising zero crossing flag to activate the event signal to the PWM blocks. The flag must be cleared before it can produce additional events to the PWM blocks." range="6" rwaccess="R/W"/>
	<bitfield id="PPB2TRIPLO" width="1" begin="5" end="5" resetval="0x0" description="Post Processing Block 2 Trip Low Event Enable. Setting this bit allows the corresponding rising trip low flag to activate the event signal to the PWM blocks. The flag must be cleared before it can produce additional events to the PWM blocks." range="5" rwaccess="R/W"/>
	<bitfield id="PPB2TRIPHI" width="1" begin="4" end="4" resetval="0x0" description="Post Processing Block 2 Trip High Event Enable. Setting this bit allows the corresponding rising trip high flag to activate the event signal to the PWM blocks. The flag must be cleared before it can produce additional events to the PWM blocks." range="4" rwaccess="R/W"/>
	<bitfield id="PPB1ZERO" width="1" begin="2" end="2" resetval="0x0" description="Post Processing Block 1 Zero Crossing Event Enable. Setting this bit allows the corresponding rising zero crossing flag to activate the event signal to the PWM blocks. The flag must be cleared before it can produce additional events to the PWM blocks." range="2" rwaccess="R/W"/>
	<bitfield id="PPB1TRIPLO" width="1" begin="1" end="1" resetval="0x0" description="Post Processing Block 1 Trip Low Event Enable. Setting this bit allows the corresponding rising trip low flag to activate the event signal to the PWM blocks. The flag must be cleared before it can produce additional events to the PWM blocks." range="1" rwaccess="R/W"/>
	<bitfield id="PPB1TRIPHI" width="1" begin="0" end="0" resetval="0x0" description="Post Processing Block 1 Trip High Event Enable. Setting this bit allows the corresponding rising trip high flag to activate the event signal to the PWM blocks. The flag must be cleared before it can produce additional events to the PWM blocks." range="0" rwaccess="R/W"/>
	</register><register id="ADC_CFG_ADCEVTINTSEL" acronym="ADC_CFG_ADCEVTINTSEL" offset="108" width="16" description="ADC Event Interrupt Selection Register.">
		<bitfield id="PPB4ZERO" width="1" begin="14" end="14" resetval="0x0" description="Post Processing Block 4 Zero Crossing Interrupt Enable. Setting this bit allows the corresponding rising zero crossing flag to activate the event interrupt signal to the PIE. The flag must be cleared before it can produce additional interrupts to the PIE." range="14" rwaccess="R/W"/>
	<bitfield id="PPB4TRIPLO" width="1" begin="13" end="13" resetval="0x0" description="Post Processing Block 4 Trip Low Interrupt Enable. Setting this bit allows the corresponding rising trip low flag to activate the event interrupt signal to the PIE. The flag must be cleared before it can produce additional interrupts to the PIE." range="13" rwaccess="R/W"/>
	<bitfield id="PPB4TRIPHI" width="1" begin="12" end="12" resetval="0x0" description="Post Processing Block 4 Trip High Interrupt Enable. Setting this bit allows the corresponding rising trip high flag to activate the event interrupt signal to the PIE. The flag must be cleared before it can produce additional interrupts to the PIE." range="12" rwaccess="R/W"/>
	<bitfield id="PPB3ZERO" width="1" begin="10" end="10" resetval="0x0" description="Post Processing Block 3 Zero Crossing Interrupt Enable. Setting this bit allows the corresponding rising zero crossing flag to activate the event interrupt signal to the PIE. The flag must be cleared before it can produce additional interrupts to the PIE." range="10" rwaccess="R/W"/>
	<bitfield id="PPB3TRIPLO" width="1" begin="9" end="9" resetval="0x0" description="Post Processing Block 3 Trip Low Interrupt Enable. Setting this bit allows the corresponding rising trip low flag to activate the event interrupt signal to the PIE. The flag must be cleared before it can produce additional interrupts to the PIE." range="9" rwaccess="R/W"/>
	<bitfield id="PPB3TRIPHI" width="1" begin="8" end="8" resetval="0x0" description="Post Processing Block 3 Trip High Interrupt Enable. Setting this bit allows the corresponding rising trip high flag to activate the event interrupt signal to the PIE. The flag must be cleared before it can produce additional interrupts to the PIE." range="8" rwaccess="R/W"/>
	<bitfield id="PPB2ZERO" width="1" begin="6" end="6" resetval="0x0" description="Post Processing Block 2 Zero Crossing Interrupt Enable. Setting this bit allows the corresponding rising zero crossing flag to activate the event interrupt signal to the PIE. The flag must be cleared before it can produce additional interrupts to the PIE." range="6" rwaccess="R/W"/>
	<bitfield id="PPB2TRIPLO" width="1" begin="5" end="5" resetval="0x0" description="Post Processing Block 2 Trip Low Interrupt Enable. Setting this bit allows the corresponding rising trip low flag to activate the event interrupt signal to the PIE. The flag must be cleared before it can produce additional interrupts to the PIE." range="5" rwaccess="R/W"/>
	<bitfield id="PPB2TRIPHI" width="1" begin="4" end="4" resetval="0x0" description="Post Processing Block 2 Trip High Interrupt Enable. Setting this bit allows the corresponding rising trip high flag to activate the event interrupt signal to the PIE. The flag must be cleared before it can produce additional interrupts to the PIE." range="4" rwaccess="R/W"/>
	<bitfield id="PPB1ZERO" width="1" begin="2" end="2" resetval="0x0" description="Post Processing Block 1 Zero Crossing Interrupt Enable. Setting this bit allows the corresponding rising zero crossing flag to activate the event interrupt signal to the PIE. The flag must be cleared before it can produce additional interrupts to the PIE." range="2" rwaccess="R/W"/>
	<bitfield id="PPB1TRIPLO" width="1" begin="1" end="1" resetval="0x0" description="Post Processing Block 1 Trip Low Interrupt Enable. Setting this bit allows the corresponding rising trip low flag to activate the event interrupt signal to the PIE. The flag must be cleared before it can produce additional interrupts to the PIE." range="1" rwaccess="R/W"/>
	<bitfield id="PPB1TRIPHI" width="1" begin="0" end="0" resetval="0x0" description="Post Processing Block 1 Trip High Interrupt Enable. Setting this bit allows the corresponding rising trip high flag to activate the event interrupt signal to the PIE. The flag must be cleared before it can produce additional interrupts to the PIE." range="0" rwaccess="R/W"/>
	</register><register id="ADC_CFG_ADCOSDETECT" acronym="ADC_CFG_ADCOSDETECT" offset="112" width="16" description="ADC Open and Shorts Detect Register.">
		<bitfield id="DETECTCFG" width="3" begin="2" end="0" resetval="0x0" description="ADC Opens and Shorts Detect Configuration. This bit field defines the open/shorts detection circuit state.  0h Open/Shorts detection circuit is disabled.  1h Open/Shorts detection circuit is enabled at zero scale.  2h Open/Shorts detection circuit is enabled at full scale.  3h Open/Shorts detection circuit is enabled at [nominal] 5/12 scale.  4h Open/Shorts detection circuit is enabled at [nominal] 7/12 scale.  5h Open/Shorts detection circuit is enabled with a [nominal] 5K pulldown to VSSA.  6h Open/Shorts detection circuit is enabled with a [nominal] 5K pullup to VDDA.  7h Open/Shorts detection circuit is enabled with a [nominal] 7K pulldown to VSSA." range="2:0" rwaccess="R/W"/>
	</register><register id="ADC_CFG_ADCCOUNTER" acronym="ADC_CFG_ADCCOUNTER" offset="114" width="16" description="ADC Counter Register.">
		<bitfield id="FREECOUNT" width="12" begin="11" end="0" resetval="0x0" description="ADC Free Running Counter Value. This bit field reflects the status of the free running ADC counter." range="11:0" rwaccess="R"/>
	</register><register id="ADC_CFG_ADCREV" acronym="ADC_CFG_ADCREV" offset="116" width="16" description="ADC Revision Register.">
		<bitfield id="REV" width="8" begin="15" end="8" resetval="0x1" description="ADC Revision. To allow documentation of differences between revisions. First version is labeled as00h" range="15:8" rwaccess="R"/>
