ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/AM263X/ADC_ADC_CFG_502C0000h.xml
		<bitfield id="REQSTAMP" width="12" begin="31" end="20" resetval="0x0" description="ADC Post Processing Block 3 Request Time Stamp. When a trigger sets the associated SOC flag in the ADCSOCFLG1 register the value of ADCCOUNTER.FREECOUNT is loaded into this bit field." range="31:20" rwaccess="R"/>
	<bitfield id="LIMITLO2EN" width="1" begin="19" end="19" resetval="0x0" description="Extended Low Limit 2 Enable.   0 = Low limit set by ADCPPB3TRIPLO register.  Not compatible with comparison with ADCPPB3PSUM or ADCPPB3SUM 1 = Low limit set by ADCPPB3TRIPLO2 register" range="19" rwaccess="R/W"/>
	<bitfield id="LSIGN" width="1" begin="16" end="16" resetval="0x0" description="Low Limit Sign Bit. This is the sign bit [17th bit] to the LIMITLO bit field when in 16-bit ADC mode." range="16" rwaccess="R/W"/>
	<bitfield id="LIMITLO" width="16" begin="15" end="0" resetval="0x0" description="ADC Post Processing Block 3 Trip Low Limit. This value sets the digital comparator trip low limit. In 16-bit mode all 17 bits will be compared against the 17 bits of the PPBRESULT bit field of the ADCPPB3RESULT register. In 12-bit mode bits 12:0 will be compared against bits 12:0 of the PPBRSULT bit field of the ADCPPB3RESULT register." range="15:0" rwaccess="R/W"/>
	</register><register id="ADC_CFG_ADCPPB4CONFIG" acronym="ADC_CFG_ADCPPB4CONFIG" offset="176" width="16" description="ADC PPB4 Config Register.">
		<bitfield id="ABSEN" width="1" begin="6" end="6" resetval="0x0" description="ADC Post Processing Block 4 Absolute Value Enable. When set this bit enables absolute value calculation on the ADCRESULx associated with ADCPPB4. This occurs before the TWOSCOMPEN logic is evaluated [so enabling both TWOSCOMPEN and ABSEN will always result in a negative value stored in ADCPPBxRESULT]   0  ADCPPB4RESULT = ADCRESULTx - ADCPPB4OFFREF   1  ADCPPB4RESULT = abs[ADCRESULTx - ADCPPB4OFFREF]" range="6" rwaccess="R/W"/>
	<bitfield id="CBCEN" width="1" begin="5" end="5" resetval="0x0" description="ADC Post Processing Block Cycle By Cycle Enable. When set, this bit enables the post conversion hardware processing circuit to automatically clear the ADCEVTSTAT on a conversion if the event condition is no longer present." range="5" rwaccess="R/W"/>
	<bitfield id="TWOSCOMPEN" width="1" begin="4" end="4" resetval="0x0" description="ADC Post Processing Block 4 Two's Complement Enable. When set this bit enables the post conversion hardware processing circuit that performs a two's complement on the output of the offset/reference subtraction unit before storing the result in the  ADCPPB4RESULT register.   0  ADCPPB4RESULT = ADCRESULTx - ADCPPB4OFFREF   1  ADCPPB4RESULT = ADCPPB4OFFREF - ADCRESULTx" range="4" rwaccess="R/W"/>
	<bitfield id="CONFIG" width="4" begin="3" end="0" resetval="0x3" description="ADC Post Processing Block 4 Configuration. This bit field defines which SOC/EOC/RESULT is associated with this post processing block.  0000 SOC0/EOC0/RESULT0 is associated with post processing block 4  0001 SOC1/EOC1/RESULT1 is associated with post processing block 4  0010 SOC2/EOC2/RESULT2 is associated with post processing block 4  0011 SOC3/EOC3/RESULT3 is associated with post processing block 4  0100 SOC4/EOC4/RESULT4 is associated with post processing block 4  0101 SOC5/EOC5/RESULT5 is associated with post processing block 4  0110 SOC6/EOC6/RESULT6 is associated with post processing block 4  0111 SOC7/EOC7/RESULT7 is associated with post processing block 4  1000 SOC8/EOC8/RESULT8 is associated with post processing block 4  1001 SOC9/EOC9/RESULT9 is associated with post processing block 4  1010 SOC10/EOC10/RESULT10 is associated with post processing block 4  1011 SOC11/EOC11/RESULT11 is associated with post processing block 4  1100 SOC12/EOC12/RESULT12 is associated with post processing block 4  1101 SOC13/EOC13/RESULT13 is associated with post processing block 4  1110 SOC14/EOC14/RESULT14 is associated with post processing block 4  1111 SOC15/EOC15/RESULT15 is associated with post processing block 4" range="3:0" rwaccess="R/W"/>
	</register><register id="ADC_CFG_ADCPPB4STAMP" acronym="ADC_CFG_ADCPPB4STAMP" offset="178" width="16" description="ADC PPB4 Sample Delay Time Stamp Register.">
		<bitfield id="DLYSTAMP" width="12" begin="11" end="0" resetval="0x0" description="ADC Post Processing Block 4 Delay Time Stamp. When an SOC starts sampling the value contained in REQSTAMP is subtracted from the value in ADCCOUNTER.FREECOUNT and loaded into this bit field, thereby giving the number of system clock cycles delay between the SOC trigger and the actual start of the sample." range="11:0" rwaccess="R"/>
	</register><register id="ADC_CFG_ADCPPB4OFFCAL" acronym="ADC_CFG_ADCPPB4OFFCAL" offset="180" width="16" description="ADC PPB4 Offset Calibration Register.">
		<bitfield id="OFFCAL" width="10" begin="9" end="0" resetval="0x0" description="ADC Post Processing Block 4 Offset Correction. This bit field can be used to digitally remove any system level offset inherent in the ADCIN circuit. This 10-bit signed value is subtracted from the ADC output before being stored in the ADCRESULT register.  000h No change. The ADC output is stored directly into ADCRESULT.  001h ADC output - 1 is stored into ADCRESULT.  002h ADC output - 2 is stored into ADCRESULT.   ...  200h ADC output + 512 is stored into ADCRESULT.   ...   3FFh  ADC output + 1 is stored into ADCRESULT. NOTE: In 16-bit mode, the subtraction will saturate at0000hand FFFFh before being stored into the ADCRESULT register. In 12-bit mode, the subtraction will saturate at0000hand 0FFFh before being stored into the ADCRESULT register. Note: in the case that multiple PPBs point to the same SOC, only the OFFCAL of the lowest numbered PPB will be applied.  " range="9:0" rwaccess="R/W"/>
	</register><register id="ADC_CFG_ADCPPB4OFFREF" acronym="ADC_CFG_ADCPPB4OFFREF" offset="182" width="16" description="ADC PPB4 Offset Reference Register.">
		<bitfield id="OFFREF" width="16" begin="15" end="0" resetval="0x0" description="ADC Post Processing Block 4 Offset Correction. This bit field can be used to either calculate the feedback error or convert a unipolar signal to bipolar by subtracting a reference value. This 16-bit unsigned value is subtracted from the ADCRESULT register before being passed through an optional two's complement function and stored in the ADCPPB4RESULT register. This subtraction is not saturated.  0000h No change. The ADCRESULT value is passed on.  0001h ADCRESULT - 1 is passed on.  0002h ADCRESULT - 2 is passed on.   ...  8000h ADCRESULT - 32,768 is passed on.   ...   FFFFh  ADCRESULT - 65,535 is passed on. NOTE: In 12-bit mode the size of this register does not change from 16-bits. It is the user's responsibility to ensure that only a 12-bit value is written to this register when in 12-bit mode." range="15:0" rwaccess="R/W"/>
	</register><register id="ADC_CFG_ADCPPB4TRIPHI" acronym="ADC_CFG_ADCPPB4TRIPHI" offset="184" width="32" description="ADC PPB4 Trip High Register.">
		<bitfield id="LIMITHI" width="24" begin="23" end="0" resetval="0x0" description="ADC Post Processing Block 4 Trip High Limit. This value sets the digital comparator trip high limit. When comparing to an ADCPPBxRESULT register, the upper bits will be ignored: - TRIPHI[23:17] will be ignored in 16 bit mode - TRIPHI[23:13] will be ignored in 12 bit mode" range="23:0" rwaccess="R/W"/>
	</register><register id="ADC_CFG_ADCPPB4TRIPLO" acronym="ADC_CFG_ADCPPB4TRIPLO" offset="188" width="32" description="ADC PPB4 Trip Low/Trigger Time Stamp Register.">
		<bitfield id="REQSTAMP" width="12" begin="31" end="20" resetval="0x0" description="ADC Post Processing Block 4 Request Time Stamp. When a trigger sets the associated SOC flag in the ADCSOCFLG1 register the value of ADCCOUNTER.FREECOUNT is loaded into this bit field." range="31:20" rwaccess="R"/>
	<bitfield id="LIMITLO2EN" width="1" begin="19" end="19" resetval="0x0" description="Extended Low Limit 2 Enable.   0 = Low limit set by ADCPPB4TRIPLO register.  Not compatible with comparison with ADCPPB4PSUM or ADCPPB4SUM 1 = Low limit set by ADCPPB4TRIPLO2 register" range="19" rwaccess="R/W"/>
	<bitfield id="LSIGN" width="1" begin="16" end="16" resetval="0x0" description="Low Limit Sign Bit. This is the sign bit [17th bit] to the LIMITLO bit field when in 16-bit ADC mode." range="16" rwaccess="R/W"/>
	<bitfield id="LIMITLO" width="16" begin="15" end="0" resetval="0x0" description="ADC Post Processing Block 4 Trip Low Limit. This value sets the digital comparator trip low limit. In 16-bit mode all 17 bits will be compared against the 17 bits of the PPBRESULT bit field of the ADCPPB4RESULT register. In 12-bit mode bits 12:0 will be compared against bits 12:0 of the PPBRSULT bit field of the ADCPPB4RESULT register." range="15:0" rwaccess="R/W"/>
	</register><register id="ADC_CFG_ADCSAFECHECKRESEN" acronym="ADC_CFG_ADCSAFECHECKRESEN" offset="192" width="32" description="ADC Safe Check Result Enable Register.">
		<bitfield id="SOC15CHKEN" width="2" begin="31" end="30" resetval="0x0" description="Determine which result will be passed to the safety result checker.  Only one of the raw ADC result, the PPB result, or the final PPB accumulated SUM can be passed on to the checker for each conversion.    00  No result passed to safety checker  01  ADCRESULT15 passed to safety checker  10   PPB Result associated with SOC15 passed to safety checker  11 PPB Sum associated with SOC15 passed to safety chekcer Note: if multiple PPBs point to the same SOC, the highest numbered PPB will have priority to pass its result to the safety checker " range="31:30" rwaccess="R/W"/>
	<bitfield id="SOC14CHKEN" width="2" begin="29" end="28" resetval="0x0" description="Determine which result will be passed to the safety result checker.  Only one of the raw ADC result, the PPB result, or the final PPB accumulated SUM can be passed on to the checker for each conversion.    00  No result passed to safety checker  01  ADCRESULT14 passed to safety checker  10   PPB Result associated with SOC14 passed to safety checker   11 PPB Sum associated with SOC14 passed to safety chekcer Note: if multiple PPBs point to the same SOC, the highest numbered PPB will have priority to pass its result to the safety checker " range="29:28" rwaccess="R/W"/>
	<bitfield id="SOC13CHKEN" width="2" begin="27" end="26" resetval="0x0" description="Determine which result will be passed to the safety result checker.  Only one of the raw ADC result, the PPB result, or the final PPB accumulated SUM can be passed on to the checker for each conversion.    00  No result passed to safety checker  01  ADCRESULT13 passed to safety checker  10   PPB Result associated with SOC13 passed to safety checker   11 PPB Sum associated with SOC13 passed to safety chekcer Note: if multiple PPBs point to the same SOC, the highest numbered PPB will have priority to pass its result to the safety checker " range="27:26" rwaccess="R/W"/>
	<bitfield id="SOC12CHKEN" width="2" begin="25" end="24" resetval="0x0" description="Determine which result will be passed to the safety result checker.  Only one of the raw ADC result, the PPB result, or the final PPB accumulated SUM can be passed on to the checker for each conversion.    00  No result passed to safety checker  01  ADCRESULT12 passed to safety checker  10   PPB Result associated with SOC12 passed to safety checker   11 PPB Sum associated with SOC12 passed to safety chekcer Note: if multiple PPBs point to the same SOC, the highest numbered PPB will have priority to pass its result to the safety checker " range="25:24" rwaccess="R/W"/>
	<bitfield id="SOC11CHKEN" width="2" begin="23" end="22" resetval="0x0" description="Determine which result will be passed to the safety result checker.  Only one of the raw ADC result, the PPB result, or the final PPB accumulated SUM can be passed on to the checker for each conversion.    00  No result passed to safety checker  01  ADCRESULT11 passed to safety checker  10   PPB Result associated with SOC11 passed to safety checker   11 PPB Sum associated with SOC11 passed to safety chekcer Note: if multiple PPBs point to the same SOC, the highest numbered PPB will have priority to pass its result to the safety checker " range="23:22" rwaccess="R/W"/>
	<bitfield id="SOC10CHKEN" width="2" begin="21" end="20" resetval="0x0" description="Determine which result will be passed to the safety result checker.  Only one of the raw ADC result, the PPB result, or the final PPB accumulated SUM can be passed on to the checker for each conversion.    00  No result passed to safety checker  01  ADCRESULT10 passed to safety checker  10   PPB Result associated with SOC10 passed to safety checker   11 PPB Sum associated with SOC10 passed to safety chekcer Note: if multiple PPBs point to the same SOC, the highest numbered PPB will have priority to pass its result to the safety checker " range="21:20" rwaccess="R/W"/>
	<bitfield id="SOC9CHKEN" width="2" begin="19" end="18" resetval="0x0" description="Determine which result will be passed to the safety result checker.  Only one of the raw ADC result, the PPB result, or the final PPB accumulated SUM can be passed on to the checker for each conversion.    00  No result passed to safety checker  01  ADCRESULT9 passed to safety checker  10   PPB Result associated with SOC9 passed to safety checker   11 PPB Sum associated with SOC9 passed to safety chekcer Note: if multiple PPBs point to the same SOC, the highest numbered PPB will have priority to pass its result to the safety checker " range="19:18" rwaccess="R/W"/>
	<bitfield id="SOC8CHKEN" width="2" begin="17" end="16" resetval="0x0" description="Determine which result will be passed to the safety result checker.  Only one of the raw ADC result, the PPB result, or the final PPB accumulated SUM can be passed on to the checker for each conversion.    00  No result passed to safety checker  01  ADCRESULT8 passed to safety checker  10   PPB Result associated with SOC8 passed to safety checker   11 PPB Sum associated with SOC8 passed to safety chekcer Note: if multiple PPBs point to the same SOC, the highest numbered PPB will have priority to pass its result to the safety checker " range="17:16" rwaccess="R/W"/>
	<bitfield id="SOC7CHKEN" width="2" begin="15" end="14" resetval="0x0" description="Determine which result will be passed to the safety result checker.  Only one of the raw ADC result, the PPB result, or the final PPB accumulated SUM can be passed on to the checker for each conversion.    00  No result passed to safety checker  01  ADCRESULT7 passed to safety checker  10   PPB Result associated with SOC7 passed to safety checker   11 PPB Sum associated with SOC7 passed to safety chekcer Note: if multiple PPBs point to the same SOC, the highest numbered PPB will have priority to pass its result to the safety checker " range="15:14" rwaccess="R/W"/>
	<bitfield id="SOC6CHKEN" width="2" begin="13" end="12" resetval="0x0" description="Determine which result will be passed to the safety result checker.  Only one of the raw ADC result, the PPB result, or the final PPB accumulated SUM can be passed on to the checker for each conversion.    00  No result passed to safety checker  01  ADCRESULT6 passed to safety checker  10   PPB Result associated with SOC6 passed to safety checker   11 PPB Sum associated with SOC6 passed to safety chekcer Note: if multiple PPBs point to the same SOC, the highest numbered PPB will have priority to pass its result to the safety checker " range="13:12" rwaccess="R/W"/>
	<bitfield id="SOC5CHKEN" width="2" begin="11" end="10" resetval="0x0" description="Determine which result will be passed to the safety result checker.  Only one of the raw ADC result, the PPB result, or the final PPB accumulated SUM can be passed on to the checker for each conversion.    00  No result passed to safety checker  01  ADCRESULT5 passed to safety checker  10   PPB Result associated with SOC5 passed to safety checker   11 PPB Sum associated with SOC5 passed to safety chekcer Note: if multiple PPBs point to the same SOC, the highest numbered PPB will have priority to pass its result to the safety checker " range="11:10" rwaccess="R/W"/>
	<bitfield id="SOC4CHKEN" width="2" begin="9" end="8" resetval="0x0" description="Determine which result will be passed to the safety result checker.  Only one of the raw ADC result, the PPB result, or the final PPB accumulated SUM can be passed on to the checker for each conversion.    00  No result passed to safety checker  01  ADCRESULT4 passed to safety checker  10   PPB Result associated with SOC4 passed to safety checker   11 PPB Sum associated with SOC4 passed to safety chekcer Note: if multiple PPBs point to the same SOC, the highest numbered PPB will have priority to pass its result to the safety checker " range="9:8" rwaccess="R/W"/>
	<bitfield id="SOC3CHKEN" width="2" begin="7" end="6" resetval="0x0" description="Determine which result will be passed to the safety result checker.  Only one of the raw ADC result, the PPB result, or the final PPB accumulated SUM can be passed on to the checker for each conversion.    00  No result passed to safety checker  01  ADCRESULT3 passed to safety checker  10   PPB Result associated with SOC3 passed to safety checker   11 PPB Sum associated with SOC3 passed to safety chekcer Note: if multiple PPBs point to the same SOC, the highest numbered PPB will have priority to pass its result to the safety checker " range="7:6" rwaccess="R/W"/>
	<bitfield id="SOC2CHKEN" width="2" begin="5" end="4" resetval="0x0" description="Determine which result will be passed to the safety result checker.  Only one of the raw ADC result, the PPB result, or the final PPB accumulated SUM can be passed on to the checker for each conversion.    00  No result passed to safety checker  01  ADCRESULT2 passed to safety checker  10   PPB Result associated with SOC2 passed to safety checker   11 PPB Sum associated with SOC2 passed to safety chekcer Note: if multiple PPBs point to the same SOC, the highest numbered PPB will have priority to pass its result to the safety checker " range="5:4" rwaccess="R/W"/>
	<bitfield id="SOC1CHKEN" width="2" begin="3" end="2" resetval="0x0" description="Determine which result will be passed to the safety result checker.  Only one of the raw ADC result, the PPB result, or the final PPB accumulated SUM can be passed on to the checker for each conversion.    00  No result passed to safety checker  01  ADCRESULT1 passed to safety checker  10   PPB Result associated with SOC1 passed to safety checker   11 PPB Sum associated with SOC1 passed to safety chekcer Note: if multiple PPBs point to the same SOC, the highest numbered PPB will have priority to pass its result to the safety checker " range="3:2" rwaccess="R/W"/>
	<bitfield id="SOC0CHKEN" width="2" begin="1" end="0" resetval="0x0" description="Determine which result will be passed to the safety result checker.  Only one of the raw ADC result, the PPB result, or the final PPB accumulated SUM can be passed on to the checker for each conversion.    00  No result passed to safety checker  01  ADCRESULT0 passed to safety checker  10   PPB Result associated with SOC0 passed to safety checker   11 PPB Sum associated with SOC0 passed to safety chekcer Note: if multiple PPBs point to the same SOC, the highest numbered PPB will have priority to pass its result to the safety checker " range="1:0" rwaccess="R/W"/>
	</register><register id="ADC_CFG_ADCINTCYCLE" acronym="ADC_CFG_ADCINTCYCLE" offset="222" width="16" description="ADC Early Interrupt Generation Cycle.">
		<bitfield id="DELAY" width="16" begin="15" end="0" resetval="0x0" description="ADC Early Interrupt Generation Cycle Delay: Defines the delay from the fall edge of ADCSOC in terms of system clock cycles, for the interrupt to be generated." range="15:0" rwaccess="R/W"/>
	</register><register id="ADC_CFG_ADCINLTRIM1" acronym="ADC_CFG_ADCINLTRIM1" offset="224" width="32" description="ADC Linearity Trim 1 Register.">
		<bitfield id="INLTRIM31TO0" width="32" begin="31" end="0" resetval="0x0" description="ADC Linearity Trim Bits 31-0. This register should not be modified unless specifically indicated by TI Errata or other documentation.  Modifying the contents of this register could cause this module to operate outside of datasheet specifications." range="31:0" rwaccess="R/W"/>
	</register><register id="ADC_CFG_ADCINLTRIM2" acronym="ADC_CFG_ADCINLTRIM2" offset="228" width="32" description="ADC Linearity Trim 2 Register.">
		<bitfield id="INLTRIM63TO32" width="32" begin="31" end="0" resetval="0x0" description="ADC Linearity Trim Bits 63-32.   This register should not be modified unless specifically indicated by TI Errata or other documentation.  Modifying the contents of this register could cause this module to operate outside of datasheet specifications." range="31:0" rwaccess="R/W"/>
	</register><register id="ADC_CFG_ADCINLTRIM3" acronym="ADC_CFG_ADCINLTRIM3" offset="232" width="32" description="ADC Linearity Trim 3 Register.">
		<bitfield id="INLTRIM95TO64" width="32" begin="31" end="0" resetval="0x0" description="ADC Linearity Trim Bits 95-64.   This register should not be modified unless specifically indicated by TI Errata or other documentation.  Modifying the contents of this register could cause this module to operate outside of datasheet specifications." range="31:0" rwaccess="R/W"/>
	</register><register id="ADC_CFG_ADCINLTRIM4" acronym="ADC_CFG_ADCINLTRIM4" offset="236" width="32" description="ADC Linearity Trim 4 Register.">
		<bitfield id="INLTRIM127TO96" width="32" begin="31" end="0" resetval="0x0" description="ADC Linearity Trim Bits 127-96.   This register should not be modified unless specifically indicated by TI Errata or other documentation.  Modifying the contents of this register could cause this module to operate outside of datasheet specifications." range="31:0" rwaccess="R/W"/>
	</register><register id="ADC_CFG_ADCINLTRIM5" acronym="ADC_CFG_ADCINLTRIM5" offset="240" width="32" description="ADC Linearity Trim 5 Register.">
		<bitfield id="INLTRIM159TO128" width="32" begin="31" end="0" resetval="0x0" description="ADC Linearity Trim Bits 159-128.   This register should not be modified unless specifically indicated by TI Errata or other documentation.  Modifying the contents of this register could cause this module to operate outside of datasheet specifications." range="31:0" rwaccess="R/W"/>
	</register><register id="ADC_CFG_ADCINLTRIM6" acronym="ADC_CFG_ADCINLTRIM6" offset="244" width="32" description="ADC Linearity Trim 6 Register.">
		<bitfield id="INLTRIM191TO160" width="32" begin="31" end="0" resetval="0x0" description="ADC Linearity Trim Bits 191-160.   This register should not be modified unless specifically indicated by TI Errata or other documentation.  Modifying the contents of this register could cause this module to operate outside of datasheet specifications." range="31:0" rwaccess="R/W"/>
	</register><register id="ADC_CFG_ADCREV2" acronym="ADC_CFG_ADCREV2" offset="250" width="16" description="ADC Wrapper Revision Register.">
		<bitfield id="WRAPPERREV" width="8" begin="15" end="8" resetval="0x0" description="ADC Revision. To allow documentation of differences between revisions. First version is labeled as00h" range="15:8" rwaccess="R"/>
	<bitfield id="WRAPPERTYPE" width="8" begin="7" end="0" resetval="0x4" description="ADC Wrapper Type. Always set to 4 for this ADC." range="7:0" rwaccess="R"/>
	</register><register id="ADC_CFG_ADCINLTRIMCTL" acronym="ADC_CFG_ADCINLTRIMCTL" offset="252" width="32" description="ADC Linearity Trim Control Register.">
